In [7]:
import pandas as pd

In [8]:
#importing data set
titanic = pd.read_csv(r"/Users/LadybirdII/Library/Mobile Documents/com~apple~CloudDocs/SMH Files/RPythonMeetUp/20200430_DescStats/titanic.csv")

In [52]:
#check data set
titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [53]:
#check column names
titanic.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

In [ ]:
#Types of data in Python
#everything is an object with an associated type (e.g. 'string' or 'function')
#scalar types: str (strings), float + integers (float, int), bool (boolean/t-f), None (null value)
#columns with mixed types are stored simply as objects

In [54]:
#Checking data types
titanic.dtypes

Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object

In [ ]:
####Discrete Variables

In [55]:
#equivalent to table function 
titanic.Sex.value_counts()

male      573
female    314
Name: Sex, dtype: int64

In [56]:
#Table (through pandas crosstable function)
pd.crosstab(index=titanic["Sex"], columns="count")

col_0   count
Sex
female    314
male      573

In [57]:
#Two-way cross tab
sex_class = pd.crosstab(index=titanic["Sex"], 
                           columns=titanic["Pclass"],
                       margins=True) #this includes row and column totals

#creating column/row totals: will help us create an prop.table analogue -- ok gotta work on this!
#sex_class.columns = ["class1","class2","class3","rowtotal"]
#sex_class.index = ["female", "male","coltotal"]

sex_class

Pclass    1    2    3  All
Sex
female   94   76  144  314
male    122  108  343  573
All     216  184  487  887

In [58]:
#Multi variate cross tab
survived_class = pd.crosstab(index=titanic["Survived"], 
                             columns=[titanic["Pclass"],
                                      titanic["Sex"]],
                             margins=True)
survived_class

Pclass        1           2           3       All
Sex      female male female male female male
Survived
0             3   77      6   91     72  296  545
1            91   45     70   17     72   47  342
All          94  122     76  108    144  343  887

In [ ]:
####IR Variables

In [59]:
#pulls basic summary statistics for numerical variables in df
titanic.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

In [60]:
#to pull summary stats for specific variable
titanic.Age.describe()

count    887.000000
mean      29.471443
std       14.121908
min        0.420000
25%       20.250000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [67]:
#for IR variables, descriptive statistics
titanic.Age.mean(axis=0)

29.471443066516347

In [69]:
#quantiles
titanic.quantile([.1, .25, .5, .75], axis = 0)

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0.10,0.0,1.0,14.80,0.0,0.0,7.5500
0.25,0.0,2.0,20.25,0.0,0.0,7.9250
0.50,0.0,3.0,28.00,0.0,0.0,14.4542
0.75,1.0,3.0,38.00,1.0,0.0,31.1375

In [ ]:
#titanic.Age.quantile([.1, .25, .5, .75])